Titanic Dataset

1. Clean data
2. Preprare data
3. Create model
4. Train model
5. ???
6. Profit

In [1]:
import pandas as pd 

titanic_path = '../../titanic/train.csv'

df = pd.read_csv(titanic_path, quotechar='"')

In [2]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Keep only desired rows and rearrange for easier view:

In [3]:
preferredOrder = ['Sex', 'Pclass', 'Cabin', 'Embarked', 'SibSp', 'Parch', 'Age', 'Fare', 'Survived']
df = df[preferredOrder]

In [4]:
df.head(5)

      Sex  Pclass Cabin Embarked  SibSp  Parch   Age     Fare  Survived
0    male       3   NaN        S      1      0  22.0   7.2500         0
1  female       1   C85        C      1      0  38.0  71.2833         1
2  female       3   NaN        S      0      0  26.0   7.9250         1
3  female       1  C123        S      1      0  35.0  53.1000         1
4    male       3   NaN        S      0      0  35.0   8.0500         0

Clean up `Cabin`

In [5]:
df['Cabin'].values[:20]

array([nan, 'C85', nan, 'C123', nan, nan, 'E46', nan, nan, nan, 'G6',
       'C103', nan, nan, nan, nan, nan, nan, nan, nan], dtype=object)

In [6]:
def cleanCabin(el):
    if isinstance(el, str):
        return el[:1]
    else:
        return '0'
df['Cabin'] = df['Cabin'].apply(cleanCabin)
df['Cabin'].values[:20]

array(['0', 'C', '0', 'C', '0', '0', 'E', '0', '0', '0', 'G', 'C', '0',
       '0', '0', '0', '0', '0', '0', '0'], dtype=object)

In [7]:
df.head(5)

      Sex  Pclass Cabin Embarked  SibSp  Parch   Age     Fare  Survived
0    male       3     0        S      1      0  22.0   7.2500         0
1  female       1     C        C      1      0  38.0  71.2833         1
2  female       3     0        S      0      0  26.0   7.9250         1
3  female       1     C        S      1      0  35.0  53.1000         1
4    male       3     0        S      0      0  35.0   8.0500         0

We will use these 4 as categories:
 - Sex
 - Pclass
 - Cabin
 - Embarked

We will use these 4 as numbers:
 - SibSp (# of **sib**lings / # of **sp**ouses)
 - Parch (# of **par**ent / # of **ch**ildren)
 - Age
 - Fare

In [8]:
categorical_data = preferredOrder[:4]
categorical_data

['Sex', 'Pclass', 'Cabin', 'Embarked']

In [9]:
numerical_data = preferredOrder[4:8]
numerical_data

['SibSp', 'Parch', 'Age', 'Fare']

In [10]:
def normalize(x, colMax):
    if isinstance(x, float):
        return x / colMax
    elif isinstance(x, int):
        return float(x) / colMax
    else:
        return 0

In [11]:
def applyNormalize(col):
    print(col)
    colMax = df[col].max()

    df[col] = df[col].apply(normalize, args=(colMax,))

In [12]:
for col in numerical_data:
    applyNormalize(col)

SibSp
Parch
Age
Fare

In [13]:
df[numerical_data].head(5)

   SibSp  Parch     Age      Fare
0  0.125    0.0  0.2750  0.014151
1  0.125    0.0  0.4750  0.139136
2  0.000    0.0  0.3250  0.015469
3  0.125    0.0  0.4375  0.103644
4  0.000    0.0  0.4375  0.015713

In [14]:
df[numerical_data].describe()

            SibSp       Parch         Age        Fare
count  891.000000  891.000000  714.000000  891.000000
mean     0.065376    0.063599    0.371239    0.062858
std      0.137843    0.134343    0.181581    0.096995
min      0.000000    0.000000    0.005250    0.000000
25%      0.000000    0.000000    0.251563    0.015440
50%      0.000000    0.000000    0.350000    0.028213
75%      0.125000    0.000000    0.475000    0.060508
max      1.000000    1.000000    1.000000    1.000000

In [15]:
from keras.utils import to_categorical

Using TensorFlow backend.

In [16]:
result = []

lol = df['Pclass']
cats = to_categorical(lol)

In [17]:
cats

array([[ 0.,  0.,  0.,  1.],
       [ 0.,  1.,  0.,  0.],
       [ 0.,  0.,  0.,  1.],
       ...,
       [ 0.,  0.,  0.,  1.],
       [ 0.,  1.,  0.,  0.],
       [ 0.,  0.,  0.,  1.]], dtype=float32)